symptom = { 
	"流行性感冒" : {"發燒", "頭痛", "肌肉痠痛", "倦怠感", "咳嗽", "喉嚨痛"}, 
	"腦膜炎" : {"反覆發燒", "頭痛", "噁心", "嘔吐", "懼光", "頸部痠痛", "睡眠中斷", "意識變化"},
	"頸部深部感染" : {"發燒", "口水吞嚥困難", "甕聲", "下巴或咽喉部位腫脹", "情緒躁動", "呼吸困難"},
	"肺炎" : {"反覆發燒", "咳嗽", "濃痰", "胸痛", "呼吸困難"},
	"膿胸" : {"反覆發燒", "胸痛", "呼吸困難"},
	"膿囊炎" : {"發燒", "噁心", "胸痛", "腹痛", "背痛"},
	"泌尿道感染" : {"發燒", "噁心", "嘔吐", "頻尿", "腰痠", "腰痛"},
	"蜂窩性組織炎" : {"軟組織腫脹"},
	"壞死性筋膜炎" : {"軟組織腫脹", "劇痛", "心悸", "意識變化"} 
	}
print("(1) 請印出只存在於其中一個疾病的臨床症狀（對稱差） ",symptom['腦膜炎']^symptom['泌尿道感染'])
print("(2) 請印出那位病人最有可能是存在哪些症狀？",symptom['肺炎']&symptom['膿胸'])
print("(3) 請印出那位病人應該沒有哪些症狀？（對稱差）",symptom['肺炎']^symptom['膿胸'])
print("(4) 請印出最近哪些臨床症狀會特別常見？（聯集）",symptom['肺炎']|symptom['流行性感冒'])
print("(5) 假如你想確認他是不是腦膜炎，請印出你應該詢問哪些症狀？（腦膜炎-膿胸的差集）",symptom['腦膜炎']-symptom['膿胸'])