x = ["2020/01", "2020/02", "2020/03", "2020/04", "2020/05", "2020/06", "2020/07", "2020/08", "2020/09", "2020/10", "2020/11", "2020/12"]
avgT = [18.0, 19.0, 22.3, 22.2, 27.5, 29.1, 29.6, 28.5, 28.1, 26.1, 23.9, 19.5]
hT = [29.0, 30.2, 33.2, 32.8, 36.9, 35.1, 36.3, 35.2, 35.1, 34.8, 33.7, 28.5]
lT = [6.9, 8.4, 14.5, 12.8, 21.8, 22.0, 24.0, 23.2, 21.7, 19.7, 18.1, 9.1]
import matplotlib.pyplot as plt
plt.figure(figsize=(10,8))			# 圖的大小
plt.plot(x, avgT, label="average", marker="o")	# 畫x軸為list x、y軸為list avgT的折線
# label這裡用不到，marker代表會在點上標示一個圓點
plt.show()					# 顯示畫出來的圖
